dynamicMesh_Piston/0/pointMotionUz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            uniformFixedValue;
        uniformValue    constant 0.4;
    }

    tank
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }
    pipe
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }
	outlet
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }
    farField
    {
        type            slip;
    }
}

// ************************************************************************* //
